### 3/28/2022

Below is a snippet from a table that contains information about employees that work at Company XYZ:  

| employee_name	| employee_id | date_joined | age |	yrs_of_experience |   
|:--|:--|:--|:--|:--|  
| Andy	| 123456	| 2015-02-15	| 45	| 24 |  
| Beth	| 789456	| NaN	| 36	| 15 |    
| Cindy	| 654123	| 2017-05-16	| 34	| 14 |   
| Dale	| 963852	| 2018-01-15	| 25	| 4 |   


Company XYZ recently migrated database systems causing some of the date_joined records to be NULL. You're told by an analyst in human resources NULL records for the date_joined field indicates the employees joined prior to 2010. You also find out there are multiple employees with the same name and duplicate records for some employees.  

**Given this, write code to find the number of employees that joined each month.** You can group all of the null values as Dec 1, 2009.  

$~$

In [1]:
import pandas as pd
import numpy as np

In [2]:
# snippet of the employee info table
employee_info = pd.DataFrame(
    {
    'employee_name': ['Andy', 'Beth', 'Cindy', 'Dale'], 
    'employee_id': [123456, 789456, 654123, 963852],
    'date_joined': ['2015-02-15', np.nan, '2017-05-16', '2018-01-15'],
    'age': [45, 36, 34, 25],
    'yrs_of_experience': [24, 15, 14, 34]
    }
)

In [3]:
# fill any null dates joined with December 1, 2009
employee_info['date_joined'] = employee_info['date_joined'].fillna('2009-12-01')

In [4]:
# remove any duplicate rows
employee_info = employee_info.drop_duplicates()

In [5]:
# create variable for the month each employee joined the company
# dates are formatted the same with the month at index values 5 and 6 (given indexing begins at 0)
employee_info['month_joined'] = employee_info['date_joined'].str.slice(5, 7)

In [6]:
# count the number of employees joining per month (and year) 
employees_per_month = employee_info.groupby('month_joined').size().reset_index()
employees_per_month.columns = ['month_joined', 'n_employees']

In [7]:
employees_per_month

  month_joined  n_employees
0           01            1
1           02            1
2           05            1
3           12            1